Revit 2027 API
NumericRevisionSettings.IsValid Method
 Determines whether the NumericRevisionSettings object is in a valid state.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the NumericRevisionSettings is valid.
Remarks
 The NumericRevisionSettings should at least contain a non-negative start number.
See Also
Reference
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace